tutorials/thermoFluidSolidInteraction/flowOverHeatedPlate/constant/fluid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1.0;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 .5 0)
    (0 .5 0)

    (0 0 .4)
    (1 0 .4)
    (1 .5 .4)
    (0 .5 .4)

    (3 0 0)
    (3 .5 0)

    (3 0 .4)
    (3 .5 .4)

    (-.5 0 0)
    (-.5 .5 0)

    (-.5 .5 .4)
    (-.5 0 .4)

);

blocks
(
    hex (12 0 3 13 15 4 7 14) (81 41 1) simpleGrading (.2 16 1)
    hex (0 1 2 3 4 5 6 7) (200 41 1) simpleGrading (5 16 1)
    hex (1 8 9 2 5 10 11 6) (51 41 1) simpleGrading (1 16 1)
);

boundary
(

    inlet
    {
        type wall;
        faces
        (
            (13 12 15 14)
        );
    }

    outlet
    {
        type wall;
        faces
        (
            (8 9 11 10)
        );
    }

    top
    {
        type wall;
        faces
        (
            (7 6 2 3)
            (9 2 6 11)
            (13 3 7 14)
        );
    }

    slip-bottom
    {
        type wall;
        faces
        (
            (15 12 0 4)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (1 8 10 5)
        );
    }

    interface
    {
        type wall;
        faces
        (
            (4 0 1 5)
        );
    }

);

// ************************************************************************* //
