tutorials/thermoFluidSolidInteraction/flowOverHeatedPlate/constant/solid/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1.0;

vertices
(

    (0 -.25 0)
    (1 -.25 0)
    (1 0 0)
    (0 0 0)

    (0 -.25 .4)
    (1 -.25 .4)
    (1 0 .4)
    (0 0 .4)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 41 1) simpleGrading (5 0.0625 1)
);

boundary
(

    left
    {
        type wall;
        faces
        (
            (4 7 3 0)
        );
    }

    right
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }

    top
    {
        type wall;
        faces
        (
            (7 6 2 3)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (4 0 1 5)
        );
    }

);

// ************************************************************************* //
