tutorials/thermoFluidSolidInteraction/flowOverHeatedPlate/constant/fsiProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fsiProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidSolidInterface thermal;

"thermalCoeffs|fixedRelaxationCoeffs"
{
    solidPatch top;
    fluidPatch interface;

    predictTemperatureAndHeatFlux true;

    relaxationFactor 1;

    interfaceDeformationLimit 0;

    outerCorrTolerance 1e-6;
    nOuterCorr 100;

    interpolatorUpdateFrequency 0;

    // couplingReuse 0;

    coupled yes;

    writeResidualsToFile yes;
}

// ************************************************************************* //
